OpenFOAM-5.x/tutorials/lagrangian/reactingParcelFilmFoam/cylinder/0.orig/wallFilmRegion/Uf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/wallFilmRegion";
    object      Uf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wallFilmFaces_top
    {
        type            slip;
    }

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            noSlip;
    }

    sides
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            slip;
    }
}


// ************************************************************************* //
